#Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Install binaries
brew 'tree'
brew 'bash'
brew 'bat'
brew 'coreutils'
brew 'git'
brew 'grep'
brew 'mas'
brew 'pkg-config'
brew 'trash'
brew 'zsh'
brew 'zsh-completions'
brew 'ansible'
brew 'postgresql'
brew 'yarn'



# Development
brew 'node'
brew 'go'
brew 'pyenv' # Python
brew 'ruby-build'
brew 'rbenv'

# Apps
cask 'alfred'
cask 'gpg-suite'
cask 'java8'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
